In [1]:
%load_ext sql

In [15]:
%sql postgresql://postgres:easwari@localhost:5432

In [3]:
%%sql
select datname from pg_database;

 * postgresql://postgres:***@localhost:5432
4 rows affected.

[('postgres',), ('window_functions',), ('template1',), ('template0',)]

In [23]:
%sql postgresql://postgres:easwari@localhost:5432/window_functions

In [26]:
%%sql
CREATE TABLE sales (
    sale_id INT PRIMARY KEY,
    salesperson_name VARCHAR(50),
    region VARCHAR(50),
    sales_amount DECIMAL(10, 2),
    sale_date DATE
);

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
Done.

[]

In [27]:
%%sql
INSERT INTO sales (sale_id, salesperson_name, region, sales_amount, sale_date) VALUES
(1, 'Jaanu', 'East', 1500.00, '2024-10-01'),
(2, 'Lavanya', 'West', 2000.00, '2024-10-02'),
(3, 'Lakshith', 'East', 1800.00, '2024-10-03'),
(4, 'Darshith', 'West', 2500.00, '2024-10-04'),
(5, 'Kutty', 'East', 1200.00, '2024-10-05');

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[]

In [48]:
%%sql
select tablename from pg_catalog.pg_tables where schemaname = 'public';

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
2 rows affected.

[('employee',), ('sales',)]

In [28]:
%%sql
select * from sales;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[(1, 'Jaanu', 'East', Decimal('1500.00'), datetime.date(2024, 10, 1)),
 (2, 'Lavanya', 'West', Decimal('2000.00'), datetime.date(2024, 10, 2)),
 (3, 'Lakshith', 'East', Decimal('1800.00'), datetime.date(2024, 10, 3)),
 (4, 'Darshith', 'West', Decimal('2500.00'), datetime.date(2024, 10, 4)),
 (5, 'Kutty', 'East', Decimal('1200.00'), datetime.date(2024, 10, 5))]

--> when you execute som query it will take more time for excecution

--> but when you create a materialized view for a portion of query

--> it will stores the result table in that view itself

--> note we cannot store the materialized view because it only stores the data at the time of view creation

In [36]:
%%sql
select salesperson_name, 
sum(sales_amount) as total_sales,max(sales_amount) as max_sales,
min(sales_amount) as min_sales,round(avg(sales_amount)) as avg_sales
from sales
group by salesperson_name;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[('Jaanu', Decimal('1500.00'), Decimal('1500.00'), Decimal('1500.00'), Decimal('1500')),
 ('Lavanya', Decimal('2000.00'), Decimal('2000.00'), Decimal('2000.00'), Decimal('2000')),
 ('Kutty', Decimal('1200.00'), Decimal('1200.00'), Decimal('1200.00'), Decimal('1200')),
 ('Lakshith', Decimal('1800.00'), Decimal('1800.00'), Decimal('1800.00'), Decimal('1800')),
 ('Darshith', Decimal('2500.00'), Decimal('2500.00'), Decimal('2500.00'), Decimal('2500'))]

In [34]:
%%sql
create materialized view sales_details as
select salesperson_name, 
sum(sales_amount) as total_sales,max(sales_amount) as max_sales,
min(sales_amount) as min_sales,round(avg(sales_amount)) as avg_sales
from sales
group by salesperson_name;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[]

In [35]:
%%sql
select * from sales_details;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[('Jaanu', Decimal('1500.00'), Decimal('1500.00'), Decimal('1500.00'), Decimal('1500')),
 ('Lavanya', Decimal('2000.00'), Decimal('2000.00'), Decimal('2000.00'), Decimal('2000')),
 ('Kutty', Decimal('1200.00'), Decimal('1200.00'), Decimal('1200.00'), Decimal('1200')),
 ('Lakshith', Decimal('1800.00'), Decimal('1800.00'), Decimal('1800.00'), Decimal('1800')),
 ('Darshith', Decimal('2500.00'), Decimal('2500.00'), Decimal('2500.00'), Decimal('2500'))]

In [37]:
%%sql
update sales 
set salesperson_name = 'joo'
where sale_id = 1;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
1 rows affected.

[]

In [38]:
%%sql
select * from sales_details;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[('Jaanu', Decimal('1500.00'), Decimal('1500.00'), Decimal('1500.00'), Decimal('1500')),
 ('Lavanya', Decimal('2000.00'), Decimal('2000.00'), Decimal('2000.00'), Decimal('2000')),
 ('Kutty', Decimal('1200.00'), Decimal('1200.00'), Decimal('1200.00'), Decimal('1200')),
 ('Lakshith', Decimal('1800.00'), Decimal('1800.00'), Decimal('1800.00'), Decimal('1800')),
 ('Darshith', Decimal('2500.00'), Decimal('2500.00'), Decimal('2500.00'), Decimal('2500'))]

--> once you refresh all changes are saved from the origional  table in the database

In [50]:
%%sql
refresh materialized view sales_details;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
Done.

[]

In [51]:
%%sql
select * from sales_details;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[('Jaanu', Decimal('1500.00'), Decimal('1500.00'), Decimal('1500.00'), Decimal('1500')),
 ('Lavanya', Decimal('2000.00'), Decimal('2000.00'), Decimal('2000.00'), Decimal('2000')),
 ('Kutty', Decimal('1200.00'), Decimal('1200.00'), Decimal('1200.00'), Decimal('1200')),
 ('Lakshith', Decimal('1800.00'), Decimal('1800.00'), Decimal('1800.00'), Decimal('1800')),
 ('Darshith', Decimal('2500.00'), Decimal('2500.00'), Decimal('2500.00'), Decimal('2500'))]

--> create non materialized view

--> non-materialized view dosent stores the resultant table

--> instead it executes the query inside the view each time and retrieve the data

In [52]:
%%sql
create or replace view sales_details_new as
select salesperson_name, sum(sales_amount) as total_sales
from sales
group by salesperson_name;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
Done.

[]

In [53]:
%%sql
select * from sales_details_new;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[('Jaanu', Decimal('1500.00')),
 ('Lavanya', Decimal('2000.00')),
 ('Kutty', Decimal('1200.00')),
 ('Lakshith', Decimal('1800.00')),
 ('Darshith', Decimal('2500.00'))]

In [54]:
%%sql
update sales 
set salesperson_name = 'keerthu'
where sale_id = 1;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
1 rows affected.

[]

In [55]:
%%sql
select * from sales_details_new;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/window_functions
5 rows affected.

[('Lavanya', Decimal('2000.00')),
 ('Kutty', Decimal('1200.00')),
 ('Lakshith', Decimal('1800.00')),
 ('Darshith', Decimal('2500.00')),
 ('keerthu', Decimal('1500.00'))]